{
  "project_type": "story",
  "date": "2020-11-25T21:08:08.136Z",
  "title": "CalStatePays",
  "description": "Data visualization web app where college bound students, counselors, and parents can view potental earnings from a selection of 7 California State Universities and a potential major.",
  "body": "## Quick Details\n* Role: UI/UX Designer & Front-End Developer\n* Project Type: Web Application\n* Project Link: [www.calstatepays.org](https://www.calstatepays.org/)\n* Source Code: NDA\n\n## Background\n\nCSUN professor of management Richard W. Moore quested the META+LAB team to develop a data visualization web application. This was the first project I got to work as part time Front-End developer at META+LAB. I used my knowledge of graphic design and learn how the application can leverage the Vue framework.\n\n## Early Stages\n\nBefore CalStatePays there was previously developed product called Learn and Earn. Learn and Earn was built with other web technologies and did not feature graphs. I was tasked with developing the User Inferface and learn how to enigneer the front-end on web applications.\n\n### Paper Wireframes\n\n![Rough sketch for how a graph would appear on mobile ](/img/paper-wirefram-1.jpg)\n\n![Rough sketch for users would input their major](/img/paper-wirefram-2.jpg)\n\n![Rough sketch for users would input their Financial Return on Education mobile](/img/paper-wirefram-3.jpg)\n\n![Rough sketch for users would input their Financial Return on Education desktop](/img/paper-wirefram-4.jpg)\n\n### Adobe XD\n\nOnce the team have on idea on how the content would be laid out. The team \n\n## Building the Front-End\n\n## Takeaways\n\nI had the chance to work with a wonder teammate to help build CalStatePays. As we were working on the project, I quickly realized about the importance of communication and code quality. Every member of the must have a clear idea of their responsible. It also does not hurt to assistant from fellow developers.  \n\n## Publicity\n\n* [Cal Poly Pomona PolyCentric](http://polycentric.cpp.edu/2019/03/website-shows-potential-salary-earnings-of-cpp-graduates/)\n* [CSUN Today](https://csunshinetoday.csun.edu/community/when-economy-slows-university-degrees-deliver-great-value-csun-experts/)",
  "cover": "/img/calstatepays-project.png"
}